{
	"displayName": "Positron Assistant",
	"description": "Provides default assistant and language models for Positron.",
	"commands.exportChatToFileInWorkspace.title": "Export the current chat to a file in the workspace",
	"commands.exportChatTo.title": "Export the current chat to...",
	"commands.enableAssistant.title": "Open settings to enable Positron Assistant",
	"commands.configureModels.title": "Configure Language Model Providers",
	"commands.logStoredModels.title": "Log the stored language models",
	"commands.generateCommitMessage.title": "Generate Commit Message",
	"commands.cancelGenerateCommitMessage.title": "Cancel Generate Commit Message",
	"commands.toggleInlineCompletions.title": "Toggle (Enable/Disable) Completions",
	"commands.managePromptFiles.title": "Manage Prompt Files",
	"commands.collectDiagnostics.title": "Collect Diagnostics",
	"commands.resetState.title": "Reset State",
	"commands.copilot.signin.title": "Copilot Sign In",
	"commands.copilot.signout.title": "Copilot Sign Out",
	"commands.category": "Positron Assistant",
	"chatParticipants.fullName": "Positron Assistant",
	"chatParticipants.ask.description": "Ask Assistant",
	"chatParticipants.agent.description": "Complete tasks in your workspace",
	"chatParticipants.commands.doc.description": "Generate documentation comments in the active editor",
	"chatParticipants.commands.explain.description": "Explain the code in the active editor",
	"chatParticipants.commands.exportQuarto.description": "Export the conversation so far into a new Quarto document.",
	"chatParticipants.commands.fix.description": "Fix issues in the active editor or Console",
	"chatParticipants.edit.description": "Edit files in your workspace",
	"configuration.title": "Positron Assistant",
	"configuration.enable.markdownDescription": "Enable [Positron Assistant](https://positron.posit.co/assistant), an AI assistant for Positron.\n\nRequires a restart to take effect.",
	"configuration.toolDetails.enable": "Enable tool call input and output details in the chat view. Must be enabled to include tool call details in the chat export.",
	"configuration.useAnthropicSdk.description": "Use the Anthropic SDK for Anthropic models rather than the generic AI SDK.",
	"configuration.streamingEdits.enable": "Enable streaming edits in inline editor chats.",
	"configuration.inlineCompletions.enable.description": "Languages for which inline completions in the editor are enabled.\n\nBy default, the setting is configured with item `*` and value `true` to enable completions for all languages. To disable completions for all languages, set the entry to item `*` and value `false`.\n\nExample: to disable completions for R files, add an item using language identifier `r` and value `false`.\n\nSee the [known language identifiers](https://code.visualstudio.com/docs/languages/identifiers#_known-language-identifiers) documentation for additional language identifiers.",
	"configuration.aiExcludes.description": "A list of [glob patterns](https://aka.ms/vscode-glob-patterns) to exclude from AI features. Files matching these patterns will not have their contents sent to AI providers for inline completions or chat context. Patterns without a `/` will match against the filename only (e.g., `*.py` matches all Python files). Use `**/` prefix for explicit recursive matching.",
	"configuration.inlineCompletionExcludes.description": "A list of [glob patterns](https://aka.ms/vscode-glob-patterns) to exclude from inline completions. Inline completions in the editor will be disabled for files matching any of the patterns.",
	"configuration.gitIntegration.description": "Enable Positron Assistant git integration.",
	"configuration.getTableSummary.description": "Enable Positron Assistant get table summary tool.",
	"configuration.showTokenUsage.description": "Show token usage in the chat view for supported providers for the session and each message and response including prompts. Check with your provider for detailed usage.",
	"configuration.maxInputTokens.description": "Override the maximum input tokens for specific language models. The key selects a model ID (partial match supported); the value is the maximum input tokens for that model.",
	"configuration.maxOutputTokens.description": "Override the maximum output tokens for specific language models. The key selects a model ID (partial match supported); the value is the maximum output tokens for that model.",
	"configuration.followups.enable.description": "Enable suggested followup prompts after chat responses.",
	"configuration.consoleActions.enable.description": "Enable Positron Assistant console actions, such as Fix and Explain.",
	"configuration.toolErrors.propagate.description": "Allow tool errors to propagate and halt the conversation, showing VS Code's error diagnostics. When disabled (default), tool errors are caught and returned to the model as conversational results.",
	"configuration.providerTimeout.description": "Specifies the timeout in seconds when signing in to a provider.\n\nThis timeout applies to each individual model test during connection.\n\nSee also `#positron.assistant.maxConnectionAttempts#` to control how many models are tested.",
	"configuration.maxConnectionAttempts.description": "Maximum number of models to test when connecting to a provider.\n\nWhen connecting to a provider, Positron Assistant may test more than one model to ensure a connection can be made. If the first model fails, it will try additional models up to this limit.\n\nHigher values provide better reliability but may take longer to connect. Each model test uses the timeout specified in `#positron.assistant.providerTimeout#`.",
	"configuration.alwaysIncludeCopilotTools.description": "Allow any model in Positron Assistant to use tools provided by GitHub Copilot.\n\nThis requires that you are signed into Copilot, and **may send data to Copilot models regardless of the selected provider when Copilot tools are used**.\n\nFor example, if you enable this setting and you are using Anthropic as a provider, GitHub Copilot tools are available. When invoked, the tools may send data to Copilot models.\n\nSee also: `#chat.useCopilotParticipantsWithOtherProviders#`",
	"configuration.models.include.description": "Enforce strict restrictions on which language models are available in Positron Assistant. When configured, **only models matching these patterns will be available**—other models will be excluded entirely from Positron Assistant.\n\nMatching is case-insensitive and supports wildcards (`*`) and regular expressions for advanced filtering.\n\n**Note:** This setting does not affect GitHub Copilot models.\n\nExamples:\n- `claude`: Only Claude models are available\n- `GPT-4o`: Only this specific model is available\n- `^claude.*opus`: Only Claude Opus models (matched by regex) are available",
	"configuration.models.preference.global.description": "A global model preference that applies across all providers in Positron Assistant. When set, this model will be used if available, unless a provider-specific preference is configured.\n\nProvider-specific preferences in `#positron.assistant.models.preference.byProvider#` take precedence over this setting.\n\nMatching is case-insensitive and supports partial matches on model ID or name. Requires a restart to take effect.\n\nUse this setting when you have a favorite model you want to use as a fallback across providers.\n\nExamples:\n- `Claude Sonnet 4.5` - Use Claude Sonnet 4.5 if available from any provider\n- `gpt-4o` - Use GPT-4o from any provider that offers it\n- `sonnet` - Use any model with 'sonnet' in its name",
	"configuration.models.preference.byProvider.description": "Provider-specific model defaults for Positron Assistant. This lets you specify which model to use as the default when a particular provider is selected.\n\nTakes precedence over `#positron.assistant.models.preference.global#`.\n\nMatching is case-insensitive and supports partial matches on model ID or name. Requires a restart to take effect.\n\nUse this setting when you want different default models for different providers.\n\nExample:\n- Item: `anthropic-api`, Value: `Claude Sonnet 4.5` - Use Claude Sonnet 4.5 when the Anthropic provider is selected\n- Item: `openai-api`, Value: `gpt-4o` - Use GPT-4o when the OpenAI provider is selected",
	"configuration.notebookSuggestions.model.description": "An ordered array of model patterns to try when generating AI suggestions for Positron Notebooks. Patterns are tried in order until a match is found.\n\nEach pattern supports partial matching on model ID or name (case-insensitive). Default is `[\"haiku\", \"mini\"]` which tries to find a model with \"haiku\" in the name first, then tries \"mini\" if not found. If no patterns match or the array is empty, falls back to the current chat session model, then the current provider's model, then the first available model.\n\nExamples:\n- `[\"haiku\", \"mini\"]` (default) tries to find a model with \"haiku\" in the name first, then tries \"mini\" if not found\n- `[\"Claude Sonnet 4.5\", \"GPT-5\"]` tries \"Claude Sonnet 4.5\" first, then \"GPT-5\"\n- `[]` disables pattern matching and uses the default fallback behavior",
	"configuration.commitMessage.modelPreference.description": "Configure model preferences for git commit message generation. Models are reordered based on these patterns rather than filtered out completely.\n\n**Default patterns** (`encouraged` and `discouraged`): Apply to all providers unless overridden.\n\n**Provider-specific patterns** (`byProvider`): Override default patterns for specific providers (e.g., `copilot`, `anthropic-api`, `openai-api`).\n\n**Encouraged patterns** (ordered by preference): Models matching these patterns are prioritized in the given order. The first pattern match gets highest priority.\n\n**Discouraged patterns** (ordered by least preferred): Models matching these patterns are deprioritized in the given order. Models matching the last pattern are used only when no other models are available.\n\nPatterns support regex matching (case-insensitive). Models are always available; this setting only affects their selection order. If no models match any patterns, the original order is preserved.\n\nDefault encouraged patterns prefer cheaper, faster models like `mini`. Default discouraged patterns avoid specialized models like `codex`.\n\nExamples:\n- Use different patterns for GitHub Copilot: `{\"byProvider\": {\"copilot\": {\"encouraged\": [\"gpt-4o-mini\"], \"discouraged\": [\"codex\", \"o1\"]}}}`\n- Global preference: `{\"encouraged\": [\"haiku\", \"mini\"], \"discouraged\": [\"codex\", \"vision\"]}`",
	"configuration.providerVariables.bedrock.description": "Variables used to configure advanced settings for Bedrock in Positron Assistant.\n\nRequires a restart to take effect.\n\nExample: to set the AWS region and profile for Amazon Bedrock, add items with keys `AWS_REGION` and `AWS_PROFILE`.",
	"configuration.providerVariables.snowflake.description": "Variables used to configure Snowflake Cortex provider in Positron Assistant.\n\nRequires a restart to take effect.\n\nExample: to set the Snowflake account and connections path, add items with keys `SNOWFLAKE_ACCOUNT` and `SNOWFLAKE_HOME`.",
	"configuration.alwaysEnableApplyInEditorAction.description": "Always enable the 'Apply in Editor' action for code blocks in Positron Assistant chats, regardless of the current language model provider.\n\nBy default, 'Apply in Editor' is only available for Copilot models.",
	"configuration.models.custom.description": "Configure custom language models for each provider. These models will be used instead of retrieving the model listing from the provider.\n\n**Note:** This setting does not affect GitHub Copilot models.\n\nUse provider IDs as keys, with arrays of model configurations as values.\n\nExample:\n```json\n{\n  \"anthropic-api\": [\n    {\n      \"name\": \"Claude Sonnet 4.5\", // required: display name\n      \"identifier\": \"claude-sonnet-4-5\", // required: API model ID\n      \"maxInputTokens\": 200000, // optional: input token limit\n      \"maxOutputTokens\": 8192 // optional: output token limit\n    }\n  ]\n}\n```"
}
